/* 
  NSError+GitHubAPI.strings
  Tower

  Created by Alexander Rinass on 12.04.12.
  Copyright (c) 2012 Fournova GmbH. All rights reserved.
*/

"CONNECTION_ERROR_DESCRIPTION" = "GitHub API Error";

"AUTHENTICATION_ERROR_DESCRIPTION" = "GitHub API Error";
"AUTHENTICATION_ERROR_FAILURE_REASON" = "Authentication with the GitHub API failed. Please verify your username and password.";

"NOT_FOUND_ERROR_DESCRIPTION" = "GitHub API Error";
"NOT_FOUND_ERROR_FAILURE_REASON" = "The GitHub resource at %@ could not be found.";

"UNPROCESSABLE_ENTITY_ERROR_DESCRIPTION" = "GitHub API Error";
"UNPROCESSABLE_ENTITY_ERROR_FAILURE_REASON" = "An error occurred for resource %@: %@";

"BAD_REQUEST_ERROR_DESCRIPTION" = "GitHub API Error";
"BAD_REQUEST_ERROR_FAILURE_REASON" = "An error occurred while accessing the resource at %@: %@";

"RESPONSE_PARSER_ERROR_DESCRIPTION" = "GitHub API Error";
"RESPONSE_PARSER_ERROR_FAILURE_REASON" = "A response from the GitHub API could not be parsed. Please try to retrieve the resource again. If the problem persists, please contact our support.";

"SERVER_ERROR_DESCRIPTION" = "GitHub API Error";
"SERVER_ERROR_FAILURE_REASON" = "An error occurred while accessing the GitHub API.";

"AUTHENTICATION_METHOD_ERROR_DESCRIPTION" = "Can not authenticate with basic authentication. Use 2FA.";
"AUTHENTICATION_METHOD_ERROR_FAILURE_REASON" = "2FA is enabled for this GitHub account.";
